USE rental;

INSERT INTO
	dvd (title, production_year)
VALUES
	('Звёздные войны 9', 2019),
	('Законопослушный гражданин', 2015),
	('Мстители', 2019),
	('Форсаж 8', 2017),
	('Просто фильм', 2018);

INSERT INTO
	customer (first_name, last_name, passport_code, registration_date)
VALUES
	('Игорь', 'Пупкин', '1234 567326', '2019-01-01'),
	('Иван', 'Козлов', '1235 567325', '2019-01-03'),
	('Вадим', 'Петров', '1236 567324', '2019-04-01'),
	('Анастасия', 'Петрова', '1239 567321', '2019-07-01'),
	('Надежда', 'Сергеева', '1224 567327', '2019-08-01');

INSERT INTO 
	offer (dvd_id, customer_id, offer_date, return_date)
VALUES
	(1, 4, '2019-01-15', '2019-05-16'),
	(2, 5, '2019-06-25', '2019-08-14'),
	(2, 3, '2019-08-19', '2019-09-25'),
	(3, 1, '2019-10-07', '2019-12-06'),
	(4, 1, '2019-11-02', null);